{"name":"chef-ruby-ppa","description":"Chef Cookbook for setting up a system Ruby using a PPA.","long_description":"# chef-ruby-ppa\n[![Build Status](https://secure.travis-ci.org/oakensoul/chef-ruby-ppa.png)](http://travis-ci.org/oakensoul/chef-ruby-ppa)\n\nChef Cookbook for installing a system Ruby using PPA.\n\n## Requirements\nThis cookbook is built for use with Chef solo and Ubuntu.\n\n### Development Requirements\nIn order to develop and test this module, you will need a handful of gems installed.\n* ChefDK - http://www.getchef.com/downloads/chef-dk/\n* Travis - `chef gem install travis`\n* Travis Lint - `chef gem install travis-lint`\n* Kitchen EC2 - `chef gem install kitchen-ec2`\n* Unicode - `chef gem install unf`\n* Git-Precommit -- `chef gem install git-precommit`\n\nYou will also need Vagrant 1.5.* installed.\n\nYou will also need the berkshelf vagrant plugins:\n* vagrant-berkshelf - `vagrant plugin install vagrant-berkshelf --plugin-version '>= 2.0.1'`\n\n### Environment Variables\nIn order to use the cloud integration, or to set up travis, you will need to have the environment variables below set.\nYou will need to copy the ec2-config.conf.example file located in the `cloud-config` folder to ec2-config.conf. You\nwill then need to update all of the variables contained inside. Updating this folder will allow you to run the\ntravis_ec2_encrypt script. In order to use cloud integration, you will either need to copy the contents of that file\ninto your .bash_profile (or equivalent), or any time you open a shell you will need to run the following command:\n`source ./cloud-config/ec2-config.conf`\n\n### Git Hooks\nYou should install the proper commit hooks for any commits, but executing `./install-git-hooks` or `VERBOSE=true ./install-git-hooks`\n\n## Integration testing\nThis project uses Test Kitchen to provide integration testing and Rake as a build utility. By default when you run rake\nit will provide usage commands. If you run `rake integration` it will perform the style and lint tasks and\nif those pass it will then run kitchen test. The default integration tests will run against a local Vagrant Virtual Box.\nIf you wish to only run the tests against vagrant, you can run `rake integration:vagrant` or `rake integration:cloud` to\ntest against the ec2 cloud VM.\n\nTravis CI will use the `rake travis` command to test style, lint and then integration:cloud.\n\nNote, if you wish to fork this project or test any changes to this project using EC2, you will need to update environment\nvariables on your system so that test-kitchen can connect to EC2. You will also need to make sure you have your EC2 SSH\nkey available for your CLI commands to use.\n\nYou should have the following environment variables set:\n* 'AWS_ACCESS_KEY_ID' - The AWS Access Key ID provided when you set up IAM\n* 'AWS_SECRET_ACCESS_KEY' - The AWS Secret Access Key provided when you set up IAM\n* 'AWS_KEYPAIR_NAME' - This is the SSH key name that you will have preloaded on your AWS VM.\n* 'AWS_USERNAME' - This should likely be 'ubuntu' if you're using a standard ubuntu AMI.\n* 'AWS_SECURITY_GROUPS' - Traffic restriction group if you use it to restrict access to your AWS instances.\n* 'LOCAL_SSH_KEY_FILE_FOR_EC2' - This should be the name of your key file, it is expected to live in ~/.ssh/\n\nIf you are connecting to HipChat, you will need to set the following:\n* 'HIPCHAT_API_TOKEN' - Your HipChat token can be created from the HipChat web admin panel.\n* 'HIPCHAT_ROOM' - The name of the room that you wish for any travis messaging to be sent to.\n\n## Travis CI\nThis project uses Travis CI for build and CI.\n\nThe same environment variables above are already encrypted in the travis.yml file for the project using the\ntravis_ec2_encrypt shell script. The values in source control are for accessing the project owner's EC2 account. This\nallows the Travis CI system to remotely spin up an EC2 instance and deploy the cookbook. If you wish to fork this repo,\nthen you will need to regenerate the encrypted values using the enclosed travis_ec2_encrypt script.\n\n## Contributing\n* [Getting Started](CONTRIBUTING.md)\n* [Bug Reports](CONTRIBUTING.md#bug-reports)\n* [Feature Requests](CONTRIBUTING.md#feature-requests)\n* [Pull Requests](CONTRIBUTING.md#pull-requests)\n\n# LICENSE\nThis repository is licensed using the Apache 2.0 License.\n\n```\nCopyright (C) 2014 Robert Gunnar Johnson Jr.\nApache License, Version 2.0, January 2004, http://www.apache.org/licenses/\n```\n","maintainer":"Robert Gunnar Johnson Jr.","maintainer_email":"github@oakensoul.com","license":"Apache 2.0","platforms":{"ubuntu":">= 0.0.0"},"dependencies":{"apt":">= 0.0.0"},"recommendations":{},"suggestions":{},"conflicting":{},"providing":{},"replacing":{},"attributes":{},"groupings":{},"recipes":{},"version":"1.0.0"}